# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\Users\ESTEBAN\Desktop\Materias\Codigos\Pscoc\as\LABVIEW\labview.cydsn\labview.cyprj
# Date: Wed, 01 Apr 2020 19:17:27 GMT
#set_units -time ns
create_clock -name {Display1_InClock(routed)} -period 8333333.333333333 -waveform {0 4166666.66666667} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Display1_InClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 200001 400001} [list [get_pins {ClockBlock/dclk_glb_0}]]


# Component constraints for D:\Users\ESTEBAN\Desktop\Materias\Codigos\Pscoc\as\LABVIEW\labview.cydsn\TopDesign\TopDesign.cysch
# Project: D:\Users\ESTEBAN\Desktop\Materias\Codigos\Pscoc\as\LABVIEW\labview.cydsn\labview.cyprj
# Date: Wed, 01 Apr 2020 19:17:25 GMT
