# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\Users\ESTEBAN\Desktop\Materias\Codigos\Pscoc\Sensor_Capacitivo_Comunicacion_USB\Sensor_Capacitivo.cydsn\Sensor_Capacitivo.cyprj
# Date: Sun, 12 May 2019 02:23:24 GMT
#set_units -time ns
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {CapSense_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 5} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Reloj_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 12001 24001} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {timer_clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 12001 24001} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {timer_clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 12001 24001} [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {Reloj_2} -source [get_pins {ClockBlock/clk_sync}] -edges {1 12001 24001} [list [get_pins {ClockBlock/dclk_glb_4}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for D:\Users\ESTEBAN\Desktop\Materias\Codigos\Pscoc\Sensor_Capacitivo_Comunicacion_USB\Sensor_Capacitivo.cydsn\TopDesign\TopDesign.cysch
# Project: D:\Users\ESTEBAN\Desktop\Materias\Codigos\Pscoc\Sensor_Capacitivo_Comunicacion_USB\Sensor_Capacitivo.cydsn\Sensor_Capacitivo.cyprj
# Date: Sun, 12 May 2019 02:23:13 GMT
