# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\Users\ESTEBAN\Desktop\Materias\Codigos\Pscoc\Carrito_arcos\carro_arcos.cydsn\carro_arcos.cyprj
# Date: Thu, 04 Jul 2019 00:32:32 GMT
#set_units -time ns
create_clock -name {ADC1_theACLK(routed)} -period 625 -waveform {0 312.5} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 15.625 -waveform {0 7.8125} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 15.625 -waveform {0 7.8125} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {ADC1_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 41 81} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {UART_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 833 1667} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {Reloj_2} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2561 5121} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {Reloj_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2561 5121} [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {Reloj_3} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2561 5121} [list [get_pins {ClockBlock/dclk_glb_4}]]
create_generated_clock -name {Reloj} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2561 5121} [list [get_pins {ClockBlock/dclk_glb_5}]]


# Component constraints for D:\Users\ESTEBAN\Desktop\Materias\Codigos\Pscoc\Carrito_arcos\carro_arcos.cydsn\TopDesign\TopDesign.cysch
# Project: D:\Users\ESTEBAN\Desktop\Materias\Codigos\Pscoc\Carrito_arcos\carro_arcos.cydsn\carro_arcos.cyprj
# Date: Thu, 04 Jul 2019 00:32:27 GMT
